In [5]:
import pyforest
import warnings
warnings.filterwarnings('ignore')
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [8]:
df=pd.read_csv(r'C:\Users\manoj\Desktop\mlproc\notebook\data\students\StudentsPerformance.csv')

In [9]:
df

     gender race/ethnicity  ... reading score writing score
0    female        group B  ...            72            74
1    female        group C  ...            90            88
2    female        group B  ...            95            93
3      male        group A  ...            57            44
4      male        group C  ...            78            75
..      ...            ...  ...           ...           ...
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[1000 rows x 8 columns]

In [10]:
df.head()

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75

[5 rows x 8 columns]

In [12]:
df.tail()

     gender race/ethnicity  ... reading score writing score
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[5 rows x 8 columns]

In [13]:
df.shape

(1000, 8)

In [15]:
df.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [19]:
df.duplicated().sum()

0

In [21]:
df.nunique()

gender                          2
race/ethnicity                  5
parental level of education     6
lunch                           2
test preparation course         2
math score                     81
reading score                  72
writing score                  77
dtype: int64

In [22]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [35]:
numerical_feature=[feature for feature in df.columns if df[feature].dtype != 'O']
categorical_feature=[features for features in df.columns if df[features].dtype == 'O']

In [36]:
numerical_feature

['math score', 'reading score', 'writing score']

In [37]:
categorical_feature

['gender',
 'race/ethnicity',
 'parental level of education',
 'lunch',
 'test preparation course']

In [38]:
df['total_score']=df['math score']+df['reading score']+df['writing score']
df['average']=df['total_score']/3

In [39]:
df.head()

   gender race/ethnicity  ... total_score    average
0  female        group B  ...         218  72.666667
1  female        group C  ...         247  82.333333
2  female        group B  ...         278  92.666667
3    male        group A  ...         148  49.333333
4    male        group C  ...         229  76.333333

[5 rows x 10 columns]

In [63]:
math_score_high=df[df['math score']==100].average.count()
reading_score_high=df[df['reading score']==100].average.count()
writing_score_high=df[df['writing score']==100].average.count()

In [64]:
print(f"the highest math score students are {math_score_high}")
print(f"the highest reading score students are {reading_score_high}")
print(f"the highest writing score students are {writing_score_high}")

the highest math score students are 7
the highest reading score students are 17
the highest writing score students are 14